{
	"banner":"Doomlazer's Give Yourself Goosebumps parody",
	"title":"Of Mice and Men",
	"length":238,
	"firstPage":1,
	"money":"Savings: $",
	"namedPages":["intro","cover","instructions","help","about"],
	"help":"Available commands:
	intro - Story and game setup.
	cover - Print an ASCII version of the book cover.
	instructions - Game rules.
	about - DL's bio.
	prev - Move backward through page history.
	quit - Exit this program.
	
	tts - Toggle text to speech if available (off by default).",
	"coverspeechtext":"An ASCII represntation of the book cover.
	There is no cover",
	"cover":"no cover",
	"intro": 
"BEWARE!! 
DO NOT READ THIS 
BOOK FROM 
BEGINNING TO END! 

ARE YOU READY FOR THE ULTIMATE 
CHALLENGE? 

It’s a whole new way to GIVE YOURSELF 
GOOSEBUMPS. There’s only one way out! If you 
don’t make all the right moves — in the right or- 
der — you'll never work on a ranch again. 

SPECIAL EDITION #1 
THE ULTIMATE CHALLENGE: 
OF MICE AND MEN 
",
	"instructions":
"
You can't win if you don't play the game. Just be
true to yourself and you can never fail.
",
	"1money":15.35,
	"1":
"The sun beats down on you as you wipe the sweat
from your brow.

\"Gosh... it sure is hot, George.\"

\"It's the humidity that gets you\". you tell Lennie.

You take the piece of straw from your mouth and care-
lessly toss it into the Salinas river.

You've been on the road for the last three days.
Three days since you were run out of Weed because
Lenn... well, sometimes Lennie just doesn't know 
his own strength.

Now you're hoping to find work on an artichoke farm
you were told about. It will only be temporary until 
you and Lennie can save up enough money to by that 
plot of farmland from an elderly couple you know.

Turn to page # 2
",
	"2":"
\"George, Tell it like me you done before.\", stammers
your slow-witted friend, Lennie.

You've been his surrogate older brother for as long as you
can remember. You keep him out of trouble. He certainly
has a penchant for getting into trouble. Some days are worse
then others.

\"Tell you what?\", you reply.

\"about the rabbits.\"

If you tell Lennie about the farm again, turn to page # 16
If you decide to put Lennie down, turn to page # 80
",
	"3money":3.11,
	"3":"
Eventually, you and Lennie arrive at the job site. Nothing
much happens besides back breaking labor, poor conditions and
meager wages. You get by on hopes for the future, but deep
down you know they are unfounded. 

Inevitably, one seasonal position took the place of another, 
and another ad infinitum. Eventualy, you die at work.

GAME OVER
",
	"6":"
Despite knowing full well that Aunt Clara had to stop giving 
Lennie mice because they died from petting them too hard, and
not to mention he just caused you to be run out of Weed after
assaulting a woman, you still believe it's a good idea to 
promise Lennie a dog.

You mentaly take note of your intention to do so.

Turn to page # 55
",
	"7":"
Lennie jolts in suprise as the mouse gnaws at the flesh of his
thumb. Instictivly, he smashes his fist into the rodent, and
thankfully so.

It turns out the mouse was on an alien scouting mission from
another galaxy looking for inhabited planets to conquer. When
the mouse never reported Earth as a prime target, it was spared
from invasion.

YOU WIN
",
	"9":"
Continuing down the road, you notice a cat basking in the sunlight
shining between the trees on the road.

Before Lennie notices you bark the order, \"Tie your damn shoe, 
Lennie!\".

While distracted, you scare off the cat with a qick toss of a rock in
general direction. A better fate for the feline than Lennie getting
wind of it.

Turn to page # 33
",
	"13":"
Lennie doesn't notice the bite as he caresses the rodent with
his thum.

\"I'll keep him in my pocket, George. Nobody has to know. I won't
say nuthing.\"

You allow him to keep the mouse for the time being and continue
down the road towards the farm.

turn to page # 33
",
	"16":"
\"You really get a kick out of it, don't you? OK.\"

The fire crackles as you briefly pause before repeating
your well-worn tale.

\"Guys like us, that work on ranches, are the loneliest guys
in the world. They got no family. They don’t belong no place.
With us it ain’t like that. We got a future. We got somebody 
to talk to that gives a damn about us. We don’t have to sit 
in no bar room blowin’ in our jack jus’ because we got no
place else to go. If them other guys gets in jail they can
rot for all anybody gives a damn. But not us.\"

Lennie broke in. “But not us! An’ why? Because… because I got
you to look after me, and you got me to look after you, and 
that’s why.”

Turn to page # 37
",
	"18":"
After Lennie calms down you resume the long walk to the farm.

Along the way, Lennie and you got to talking. He asks which you
prefer, dogs, cats or mice?

If you prefer dogs, turn to page # 26
If you prefer cats, turn to page # 9
If you prefer mice, turn to page # 22
",
	"19":"
\"BAD BIRD!\", asserts Lennie; reaching down to grab the hawk out
of a low flutter with his massive left hand.

A sick cruching sound could be heard as Lennie squeezed down on it.
Shortly after, all life drained from the bird's eyes.

The mouse scurried happily away as you continued down the road.
You were already a day late for work, so needed to hurry.

Turn to page # 33
",
	"22":"
A bit down along the road you encounter in the roadway a small
brown mouse chewing on bit of moldy cheese.

Suddenly a Hawk swoops down attacking the defensless mouse. The
hawk fails to strike a killing blow and they scuffle awkwardly.

If you tell Lennie to smash the hawk, turn to page # 19
If you tell Lennie to bash the mouse, turn to page # 34
",
	"25":"
Throwing away the mouse sends Lennie in to an uncontrollable
rage. You've never seen such a look of pure hatred before;
especially from usually kind-hearted Lennie.

\"That was mine George! You've done a bad thing.\"

Lennie brings one of his basket ball sized fists down on your
skull. You drop to you knees, fighting to remain conscious.

\"Bad, bad, bad... It was my mouse\"

This time Lennie raises both fists above his head. You
futilely try to block the attack with your forearms, but
Lennie crushes your head like a watermelon at a Ghalager
comedy show.

GAME OVER
",
	"26":"

",
	"33":"

",
	"34roll":"",
	"34":"
\"Lennie, you can have that mouse\", you shout with some
urgency. Perhaps sensing the mouse is not what it seems.

Knocking away the hawk and taking the mouse in his massive
hands, Lennie is immediately bit. 


Roll the two dice.

If they add up to 7 or higher, go to # 7.
If they add up to 6 or lower, go to # 13. 
",
	"37roll":"",
	"37":"
You notice Lennie fidgeting with something in his coat pocket.

\"Now, what you got there, Lennie.\"

\"I don't have anything. I never done nothing.\", protests
Lennie.

\"Come on now. Give it here.\"

Lennie's been keeping a dead mouse in his pocket. a patch
of fur on it's back has been rubbed away and the mouse's
neck apears to be broken. You throw the rotting mouse into
the woods.

Roll the two dice.

If they add up to 8 or higher, go to # 41.
If they add up to 7 or lower, go to # 25. 
",
	"41":"
Lennie bursts into tears and begins blubbering about the
dead mouse. You'd almost feel sorry for the guy if it 
hadn't been actively decomposing.

\"Now, I wasn't taking it away for meanness. That mouse
wasn't fresh, Lennie. Tell you what I'll do. First chance
I get, I'll get ya a puppy. That'd be better than mice.
You can pet em harder.\"

If you really believe giving Lennie a puppy is a good
idea, turn to page # 6.
If you were only saying it to stop his crying, turn to 
page # 55.
",
	"55roll":"",
	"55":"
Roll the two dice.

If they add up to 11 or higher, go to # 18.
If they add up to 10 or lower, go to # 3.
",
	"80":"
Having read the cliff notes in High School, you know
Lennie just can't help but to kill. It's in his nature.

Instructing him to look out across the Salinas river, you
pause briefly after pointing your revolver to the back of
Lennie's head.

Will killing him just in turn create some sort of
supernatural murder ghost? You think that's a risk
you're just going to have to take.

GAME OVER
",
	"about":
"About Doomlazer 

Doomlazer is the least popular author in America. 
He is the creator of the KQIV: TBoR mod and co-creator
of The SPR3, among other unpopular projects. He has 
written more than 100 scary songs. DL lives in Portland,
OR alone.
"
}